# Project 2
Submitted by Candace Grant

 Create a .CSV file (or optionally, a MySQL database!) that includes all of the information included in the dataset. You’re encouraged to use a “wide” structure similar to how the information appears in the discussion item, so that you can practice tidying and transformations as described below.
- Read the information from your .CSV file into Python, and use pandas as needed to tidy and transform your data. [Most of your grade will be based on this step!]
- Perform the analysis requested in the discussion item.
- Your code should be in an Jupyter Notebook, posted to your GitHub repository, and
should include narrative descriptions of your data cleanup work, analysis, and
conclusions.

In [2]:
import numpy as np
import pandas as pd
import re

# Dataset 1 
California Cities

- Which cities have the greatest amount of open water? 
- Which cities have the highest elevation? 
- Which cities have the greatest ratio of land area to water?

In [3]:
df_cities = pd.read_csv("/Users/candacegrant/Desktop/IS362 Date Acquisition/california_cities.csv")

In [65]:
df_cities.head()

,Unnamed: 0,city,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
0,0,Adelanto,34.576111,-117.432778,875.0,2871.0,31765,56.027,56.009,0.018,145.107,145.062,0.046,0.03
1,1,AgouraHills,34.153333,-118.761667,281.0,922.0,20330,7.822,7.793,0.029,20.260,20.184,0.076,0.37
2,2,Alameda,37.756111,-122.274444,NaN,33.0,75467,22.960,10.611,12.349,59.465,27.482,31.983,53.79
3,3,Albany,37.886944,-122.297778,NaN,43.0,18969,5.465,1.788,3.677,14.155,4.632,9.524,67.28
4,4,Alhambra,34.081944,-118.135000,150.0,492.0,83089,7.632,7.631,0.001,19.766,19.763,0.003,0.01

In [66]:
df_cities.shape

(482, 14)

In [67]:
# Based on the analysis above we see that there are 482 rows. Some of the columns are missing values. For example,
# elevation meters and elevation feet have missing values, among others.
# the method.describe() gives more detailed statistics on the various parameters
df_cities.describe()

,Unnamed: 0,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
count,482.000000,482.000000,482.000000,434.000000,470.000000,4.820000e+02,480.000000,482.000000,481.000000,477.000000,478.000000,478.000000,477.000000
mean,240.500000,36.095088,-119.837714,180.416705,567.168723,6.489493e+04,18.442183,16.840981,1.589630,46.753283,43.547021,3.125178,5.301801
std,139.285678,2.298006,2.147676,309.531825,1001.265722,2.032041e+05,36.363230,32.694647,9.490386,90.972269,84.933022,11.562269,14.656428
min,0.000000,32.578333,-124.263333,-34.000000,-180.000000,1.000000e+00,0.314000,0.314000,0.000000,0.813000,0.813000,0.000000,0.000000
25%,120.250000,33.977292,-121.954931,22.000000,69.000000,1.090200e+04,3.708250,3.506500,0.000000,9.551000,9.025000,0.000250,0.000000
50%,240.500000,36.204722,-119.708611,67.000000,200.000000,2.905750e+04,9.093000,8.362000,0.029000,23.551000,21.533000,0.078500,0.340000
75%,360.750000,37.886667,-117.977292,173.500000,515.000000,6.646650e+04,19.878250,19.090000,0.244000,51.772000,49.322000,0.623250,1.870000
max,481.000000,41.965000,-114.596389,2402.000000,7880.000000,3.884307e+06,503.000000,469.000000,185.020000,1302.000000,1214.000000,122.270000,84.580000

In [5]:
#  After analyzing the dayta the first step is to rename the unnamed first column to a string
df_cities_cols =['unnamed', 'city', 'latd', 'longd', 'elevation_m', 'elevation_ft',
       'population_total', 'area_total_sq_mi', 'area_land_sq_mi',
       'area_water_sq_mi', 'area_total_km2', 'area_land_km2', 'area_water_km2',
       'area_water_percent']
df_cities.columns = df_cities_cols
df_cities.head()

,unnamed,city,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
0,0,Adelanto,34.576111,-117.432778,875.0,2871.0,31765,56.027,56.009,0.018,145.107,145.062,0.046,0.03
1,1,AgouraHills,34.153333,-118.761667,281.0,922.0,20330,7.822,7.793,0.029,20.260,20.184,0.076,0.37
2,2,Alameda,37.756111,-122.274444,NaN,33.0,75467,22.960,10.611,12.349,59.465,27.482,31.983,53.79
3,3,Albany,37.886944,-122.297778,NaN,43.0,18969,5.465,1.788,3.677,14.155,4.632,9.524,67.28
4,4,Alhambra,34.081944,-118.135000,150.0,492.0,83089,7.632,7.631,0.001,19.766,19.763,0.003,0.01

In [9]:
# The next step is to remove the column titled "unnamed"
df_cities.drop('unnamed', axis=1, inplace=True)
df_cities.head()

,city,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
0,Adelanto,34.576111,-117.432778,875.0,2871.0,31765,56.027,56.009,0.018,145.107,145.062,0.046,0.03
1,AgouraHills,34.153333,-118.761667,281.0,922.0,20330,7.822,7.793,0.029,20.260,20.184,0.076,0.37
2,Alameda,37.756111,-122.274444,NaN,33.0,75467,22.960,10.611,12.349,59.465,27.482,31.983,53.79
3,Albany,37.886944,-122.297778,NaN,43.0,18969,5.465,1.788,3.677,14.155,4.632,9.524,67.28
4,Alhambra,34.081944,-118.135000,150.0,492.0,83089,7.632,7.631,0.001,19.766,19.763,0.003,0.01

In [10]:
#  The data is furthur cleaned up by fixing the spacing in city names using restructured text and pytho code.
def split_on_upper_case(text):
    split_list = re.findall('[A-Z][^A-Z]*', text)
    return ' '.join(split_list)

df_cities['city'] = df_cities['city'].apply(split_on_upper_case)

df_cities['city'].head(5)

0        Adelanto
1    Agoura Hills
2         Alameda
3          Albany
4        Alhambra
Name: city, dtype: object

### Top 10 California cities with greatest amount of open water

In [22]:
## Top 10 California cities with greatest amount of open water
df_cities[['city', 'area_water_sq_mi']].sort_values('area_water_sq_mi', ascending=False).head(10)

                    city  area_water_sq_mi
370        San Francisco           185.020
367            San Diego            47.210
239          Los Angeles            34.000
285        Newport Beach            29.173
93              Coronado            24.735
104           Dana Point            22.987
387        Santa Barbara            22.500
345             Richmond            22.412
290              Oakland            22.216
418  South San Francisco            21.017

### Top 10 California cities with the highest elevation

In [8]:
# Top 10 California cities with the highest elevation

# feets vs meters
df_cities[['city', 'elevation_ft']].sort_values('elevation_ft', ascending=False).head(10)

                 city  elevation_ft
246     Mammoth Lakes        7880.0
39      Big Bear Lake        6752.0
416  South Lake Tahoe        6237.0
436           Truckee        5817.0
242          Loyalton        4951.0
330           Portola        4856.0
6             Alturas        4370.0
114            Dorris        4245.0
424        Susanville        4186.0
41             Bishop        4150.0

### Top 10 California cities with the greatest ratio of land area to water

In [9]:
# Top 10 California cities with the greatest ratio of land area to water

# feets vs meters
df_cities[['city', 'area_water_percent']].sort_values('area_water_percent', ascending=False).head(10)

                    city  area_water_percent
48              Brisbane               84.58
146          Foster City               81.07
366            Sand City               80.77
370        San Francisco               80.00
35             Belvedere               78.42
104           Dana Point               77.96
93              Coronado               75.72
319          Pismo Beach               73.29
65           Carpinteria               72.11
418  South San Francisco               69.69

## Dataset 2 
Leading Cause of Death in New York City

- Which cause of death had most deaths in 2014?
- Which cause of death had the lowest death rate in 2014?
- What are the top 5 causes of death for Asian and Pacific Islander in 2014?

In [12]:
# The first step is to read the csv file from its stored location
df_death = pd.read_csv("/Users/candacegrant/Desktop/IS362 Date Acquisition/New_York_City_Leading_Causes_of_Death.csv")

In [13]:
# Preview of the dataset to get a sample of the data
df_death.head(10)

,Year,Leading Cause,Sex,Race Ethnicity,Deaths,Death Rate,Age Adjusted Death Rate
0,2014,Diabetes Mellitus (E10-E14),F,Other Race/ Ethnicity,11,.,.
1,2011,Cerebrovascular Disease (Stroke: I60-I69),M,White Non-Hispanic,290,21.7,18.2
2,2008,Malignant Neoplasms (Cancer: C00-C97),M,Not Stated/Unknown,60,.,.
3,2010,Malignant Neoplasms (Cancer: C00-C97),F,Hispanic,1045,85.9,98.5
4,2012,Cerebrovascular Disease (Stroke: I60-I69),M,Black Non-Hispanic,170,19.9,23.3
5,2007,Mental and Behavioral Disorders due to Use of ...,M,Not Stated/Unknown,.,.,.
6,2011,All Other Causes,F,Not Stated/Unknown,14,.,.
7,2007,Chronic Lower Respiratory Diseases (J40-J47),F,Black Non-Hispanic,163,15.5,14.8
8,2012,Essential Hypertension and Renal Diseases (I10...,F,Hispanic,101,8.2,9.5
9,2009,"Diseases of Heart (I00-I09, I11, I13, I20-I51)",M,Hispanic,1382,123.1,227.9

In [12]:
# Check datatypes of data
df_death.dtypes

Year                        int64
Leading Cause              object
Sex                        object
Race Ethnicity             object
Deaths                     object
Death Rate                 object
Age Adjusted Death Rate    object
dtype: object

In [14]:
# Replace all instances of '.' with a null value. The '.' affects sorting results.
df_death = df_death.replace(to_replace='.', value=np.nan)

In [15]:
# Convert 'Deaths', 'Death Rate', 'Age Adjusted Death Rate' to numeric values.
df_death[['Deaths', 'Death Rate', 'Age Adjusted Death Rate']] = df_death[['Deaths', 'Death Rate', 
                                                              'Age Adjusted Death Rate']].apply(pd.to_numeric)

# Check new datatypes to confirm they changed to numeric data types
df_death.dtypes

Year                         int64
Leading Cause               object
Sex                         object
Race Ethnicity              object
Deaths                     float64
Death Rate                 float64
Age Adjusted Death Rate    float64
dtype: object

### This code sorts the data by year and deaths to find the most deaths in 2014 and the cause of death

In [16]:
# This code sorts the data by year and deaths to find the most deaths in 2014.
df_death[df_death['Year']==2014].sort_values('Deaths', ascending=False).head(1)

,Year,Leading Cause,Sex,Race Ethnicity,Deaths,Death Rate,Age Adjusted Death Rate
620,2014,"Diseases of Heart (I00-I09, I11, I13, I20-I51)",F,White Non-Hispanic,4507.0,318.0,161.0

### This code shows the cause of death with the lowest death rate

In [17]:
# Lowest death rate in 2014
df_death[df_death['Year']==2014].sort_values('Death Rate').head(1)

,Year,Leading Cause,Sex,Race Ethnicity,Deaths,Death Rate,Age Adjusted Death Rate
342,2014,Alzheimer's Disease (G30),F,Asian and Pacific Islander,26.0,4.2,4.7

### This code shows the 5 causes of death among Asian and Pacific Islander in 2014 by death count

In [18]:
# Top 5 causes of death for Asian and Pacific Islander in 2014 by death count
df_death[(df_death['Year']==2014) & (df_death['Race Ethnicity']=='Asian and Pacific Islander')].sort_values('Deaths', 
                                                                                          ascending=False).head(5)

,Year,Leading Cause,Sex,Race Ethnicity,Deaths,Death Rate,Age Adjusted Death Rate
210,2014,Malignant Neoplasms (Cancer: C00-C97),M,Asian and Pacific Islander,657.0,114.5,129.5
988,2014,"Diseases of Heart (I00-I09, I11, I13, I20-I51)",M,Asian and Pacific Islander,554.0,96.5,118.5
344,2014,Malignant Neoplasms (Cancer: C00-C97),F,Asian and Pacific Islander,502.0,80.2,80.6
567,2014,"Diseases of Heart (I00-I09, I11, I13, I20-I51)",F,Asian and Pacific Islander,462.0,73.8,81.1
54,2014,All Other Causes,M,Asian and Pacific Islander,424.0,73.9,90.4

## Dataset 3
Planes
- Find the plane manufacturer with the most seats?

In [20]:
# The data must first be read from the data source and checked as shown in In[17] below.
df_planes = pd.read_csv("/Users/candacegrant/Desktop/IS362 Date Acquisition/planes.csv")

In [17]:
df_planes.head(10)

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan
5,N105UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
6,N107US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
7,N108UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
8,N109UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
9,N110UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan

In [18]:
# The years column should not have decimals. The year column is first converted from a float to a string.

df_planes['year'] = df_planes['year'].astype(str).apply(lambda x: x.split('.')[0])

# then convert from string back to a int/float where possible
df_planes['year'] = pd.to_numeric(df_planes['year'], errors='ignore')

df_planes['year'].head(5)

0    2004
1    1998
2    1999
3    1999
4    2002
Name: year, dtype: object

In [22]:
# All the unique manufacturers -- too many to calculate avg. speed independently so we need to group by manufacturer
df_planes['manufacturer'].unique()

array(['EMBRAER', 'AIRBUS INDUSTRIE', 'BOEING', 'AIRBUS', 'BOMBARDIER INC',
       'CESSNA', 'JOHN G HESS', 'GULFSTREAM AEROSPACE', 'SIKORSKY',
       'PIPER', 'AGUSTA SPA', 'PAIR MIKE E', 'DOUGLAS', 'BEECH', 'BELL',
       'AVIAT AIRCRAFT INC', 'STEWART MACO', 'LEARJET INC',
       'MCDONNELL DOUGLAS', 'CIRRUS DESIGN CORP', 'HURLEY JAMES LARRY',
       'KILDALL GARY', 'LAMBERT RICHARD', 'BARKER JACK L',
       'AMERICAN AIRCRAFT INC', 'ROBINSON HELICOPTER CO', 'FRIEDEMANN JON',
       'LEBLANC GLENN T', 'MARZ BARRY', 'DEHAVILLAND', 'CANADAIR',
       'CANADAIR LTD', 'MCDONNELL DOUGLAS CORPORATION',
       'MCDONNELL DOUGLAS AIRCRAFT CO', 'AVIONS MARCEL DASSAULT'], dtype=object)

In [23]:
# Groupby manufacturer and return the average speed on each manufacturer. As is obvious from the result below in 
# Out[23] there are so many missing columns that an analysis of speed by manufacturer would not have been very 
# conclusive so the research question was modified to return the maximum number of seats by manufacturer.
df_planes.groupby('manufacturer')['speed'].max()

manufacturer
AGUSTA SPA                         NaN
AIRBUS                             NaN
AIRBUS INDUSTRIE                   NaN
AMERICAN AIRCRAFT INC              NaN
AVIAT AIRCRAFT INC                 NaN
AVIONS MARCEL DASSAULT             NaN
BARKER JACK L                      NaN
BEECH                            202.0
BELL                             112.0
BOEING                             NaN
BOMBARDIER INC                     NaN
CANADAIR                           NaN
CANADAIR LTD                       NaN
CESSNA                           167.0
CIRRUS DESIGN CORP                 NaN
DEHAVILLAND                       95.0
DOUGLAS                          232.0
EMBRAER                            NaN
FRIEDEMANN JON                     NaN
GULFSTREAM AEROSPACE               NaN
HURLEY JAMES LARRY                 NaN
JOHN G HESS                        NaN
KILDALL GARY                       NaN
LAMBERT RICHARD                    NaN
LEARJET INC                        NaN
LEBLANC GLENN T                    NaN
MARZ BARRY                         NaN
MCDONNELL DOUGLAS                432.0
MCDONNELL DOUGLAS AIRCRAFT CO      NaN
MCDONNELL DOUGLAS CORPORATION      NaN
PAIR MIKE E                        NaN
PIPER                            162.0
ROBINSON HELICOPTER CO             NaN
SIKORSKY                           NaN
STEWART MACO                       NaN
Name: speed, dtype: float64

In [24]:
# This data will provide a more realistic analysis
df_planes.groupby('manufacturer')['seats'].max()

manufacturer
AGUSTA SPA                         8
AIRBUS                           379
AIRBUS INDUSTRIE                 379
AMERICAN AIRCRAFT INC              2
AVIAT AIRCRAFT INC                 2
AVIONS MARCEL DASSAULT            12
BARKER JACK L                      2
BEECH                             10
BELL                              11
BOEING                           450
BOMBARDIER INC                    95
CANADAIR                          55
CANADAIR LTD                       2
CESSNA                             8
CIRRUS DESIGN CORP                 4
DEHAVILLAND                       16
DOUGLAS                          102
EMBRAER                           55
FRIEDEMANN JON                     2
GULFSTREAM AEROSPACE              22
HURLEY JAMES LARRY                 2
JOHN G HESS                        2
KILDALL GARY                       2
LAMBERT RICHARD                    2
LEARJET INC                       11
LEBLANC GLENN T                    2
MARZ BARRY                         2
MCDONNELL DOUGLAS                172
MCDONNELL DOUGLAS AIRCRAFT CO    142
MCDONNELL DOUGLAS CORPORATION    142
PAIR MIKE E                        2
PIPER                              8
ROBINSON HELICOPTER CO             5
SIKORSKY                          14
STEWART MACO                       2
Name: seats, dtype: int64

In [21]:
# First the number of planes by manufacturer is obtained. 
#This seems intuitive that manufacturers with the most planes will have the most total number of seats,
# but furthur analysis will be done to confirm.
df_planes['manufacturer'].value_counts()

BOEING                           1630
AIRBUS INDUSTRIE                  400
BOMBARDIER INC                    368
AIRBUS                            336
EMBRAER                           299
MCDONNELL DOUGLAS                 120
MCDONNELL DOUGLAS AIRCRAFT CO     103
MCDONNELL DOUGLAS CORPORATION      14
CANADAIR                            9
CESSNA                              9
PIPER                               5
BEECH                               2
GULFSTREAM AEROSPACE                2
STEWART MACO                        2
AMERICAN AIRCRAFT INC               2
BELL                                2
PAIR MIKE E                         1
AVIONS MARCEL DASSAULT              1
KILDALL GARY                        1
HURLEY JAMES LARRY                  1
LEARJET INC                         1
DEHAVILLAND                         1
AGUSTA SPA                          1
LEBLANC GLENN T                     1
AVIAT AIRCRAFT INC                  1
LAMBERT RICHARD                     1
CIRRUS DESIGN CORP                  1
BARKER JACK L                       1
MARZ BARRY                          1
SIKORSKY                            1
ROBINSON HELICOPTER CO              1
CANADAIR LTD                        1
FRIEDEMANN JON                      1
JOHN G HESS                         1
DOUGLAS                             1
Name: manufacturer, dtype: int64

In [13]:
# The data matches earlier intuition as manufacturers such as Boeing ans Airbus Industrie who produce the most planes 
# have the most cumulative number of seats.
seats_manufacturer = df_planes.groupby('manufacturer')['seats'].sum()
seats_manufacturer

manufacturer
AGUSTA SPA                            8
AIRBUS                            74324
AIRBUS INDUSTRIE                  74961
AMERICAN AIRCRAFT INC                 4
AVIAT AIRCRAFT INC                    2
AVIONS MARCEL DASSAULT               12
BARKER JACK L                         2
BEECH                                19
BELL                                 16
BOEING                           285556
BOMBARDIER INC                    27235
CANADAIR                            495
CANADAIR LTD                          2
CESSNA                               48
CIRRUS DESIGN CORP                    4
DEHAVILLAND                          16
DOUGLAS                             102
EMBRAER                           13645
FRIEDEMANN JON                        2
GULFSTREAM AEROSPACE                 44
HURLEY JAMES LARRY                    2
JOHN G HESS                           2
KILDALL GARY                          2
LAMBERT RICHARD                       2
LEARJET INC                          11
LEBLANC GLENN T                       2
MARZ BARRY                            2
MCDONNELL DOUGLAS                 19446
MCDONNELL DOUGLAS AIRCRAFT CO     14626
MCDONNELL DOUGLAS CORPORATION      1988
PAIR MIKE E                           2
PIPER                                34
ROBINSON HELICOPTER CO                5
SIKORSKY                             14
STEWART MACO                          4
Name: seats, dtype: int64

In [14]:
# When the data is sorted the top 20 values matches earlier predictions. 
seats_manufacturer.sort_values(ascending=False).head(20)

manufacturer
BOEING                           285556
AIRBUS INDUSTRIE                  74961
AIRBUS                            74324
BOMBARDIER INC                    27235
MCDONNELL DOUGLAS                 19446
MCDONNELL DOUGLAS AIRCRAFT CO     14626
EMBRAER                           13645
MCDONNELL DOUGLAS CORPORATION      1988
CANADAIR                            495
DOUGLAS                             102
CESSNA                               48
GULFSTREAM AEROSPACE                 44
PIPER                                34
BEECH                                19
BELL                                 16
DEHAVILLAND                          16
SIKORSKY                             14
AVIONS MARCEL DASSAULT               12
LEARJET INC                          11
AGUSTA SPA                            8
Name: seats, dtype: int64

In [15]:
# find the manufacturer with the most seats. We can see that Boeing indeed tops the list.
seats_manufacturer.sort_values(ascending=False).head(1)

manufacturer
BOEING    285556
Name: seats, dtype: int64

### Conclusion

When raw data has extensive missing entries, analysis will be inconclusive. It is best to 
reference dataset with another credible source with similar info before doing any analysis.  Another option is to use 
another parameter that can provide similar analysis. In this case for dataset #3, the number of seats tell which airplanes carry 
the most passengers and this can be used to do furthur analysis on the maintainence schedules of these planes and
create further possible correlation with maintainenece shedules and flight delays.  Sometimes data can be in the wrong 
format such as a float when it should be a sting and formatting data befor analysis is important in order to get an 
accurate conclusion.